"""
Ответы Пушкина о себе
"""

import random
import time

random.seed(time.time())

# Факты о детях. Выдаётся случайный с помощью функции get_answers_deti()
answers_deti = [
    "Мой первый ребёнок — Наталья. Сейчас она занимается хозяйством в нашем "
    "доме в Михайловском. Замужем за соседом, Павлом Ивановичем Щербиным.",
    "Мой второй ребёнок — Мария. Влюблена в приказчика из соседней деревни.",
    "Мой третий ребёнок — Александр. Он ещё совсем маленький.",
    "Моя старшая дочь — Мария. Теперь она замужем за генералом, у них дом "
    "в Санкт-Петербурге.",
    "Моя вторая дочь — Елизавета. Недавно вышла замуж за моряка. Теперь они "
    "живут в Севастополе.",
    "Мой младший сын — Захар. Недавно ему исполнилось два года.",
    "У моих детей три гувернантки.",
    "За прошлый год дети съели три десятка яиц, несколько фунтов масла и "
    "20 фунтов сахара.",
    "В этом году дети уже три раза болели.",
    "Мои дети говорят на трёх языках.",
    "Моя старшая дочь знает латынь.",
    "Мои дети едят 12 раз в день.",
    "Мои дочери вышивают, а сын учится у гувернантки чтению и письму.",
    "Дети играют в куклы, в «мраморные» шарики, в «золотые» шары, в «жмурки».",
    "Дети ездят верхом на лошадях.",
    "Дети очень любят конфеты, пирожное, сыр, мёд, варенье, молоко, булочки.",
    "У моих дочерей есть три коровы.",
    "Дети имеют собственный домашний театр.",
    "Дочери практиковались в пении и игре на фортепиано.",
    "Дети слышали выстрел пушки, когда стали выезжать в большую дорогу.",
    "Дети ехали в кибитке, запряжённой тройкой лошадей.",
    "Дети пили козье молоко.",
    "Дети собирали грибы и ягоды.",
    "Дети купались в речке.",
    "Дети видели стадо коров.",
    "Дети видели, как косят траву.",
    "Дети видели, как пашут землю.",
    "Дети видели, как жнут рожь.",
    "Дети видели, как молотят хлеб.",
    "Дети видели, как веют рожь.",
    "Александр Александрович Пушкин родился в 1833 году в Санкт-Петербурге",
    "Как и отец, Александр Александрович Пушкин учился в Царскосельском лицее.",
    "Александр Александрович в 1851 году поступил в лейб-гвардии конный полк.",
    "Александр Александрович был женат на Марии Александровне Павловой, "
    "от которой у него было шестеро детей.",
    "Александр Александрович Пушкин участвовал в Крымской войне 1853-1856 "
    "годов и был награжден за храбрость.",
    "После смерти отца в 1837 году, Александр Александрович стал главой семьи "
    "Пушкиных и унаследовал его литературные произведения и рукописи.",
    "Он умер 1 августа 1914 года, ровно в день вступления России в "
    "Первую мировую войну.",
    "Наталья Александровна Пушкина - младшая дочь.",
    "Наталья родилась 23 мая 1836 года в Санкт-Петербурге.",
    "У Натальи две старшие сестры - Мария и Александра, и два старших "
    "брата - Григорий и Михаил.",
    "Когда отец был убит в 1837 году на дуэли, Наталье был всего один год.",
    "В возрасте 17 лет Наталья вышла замуж за Михаила Дубельта.",
    "У Натальи было пятеро детей: Леонтий, Николай, Анна, Евгений и Мария.",
    "В 1868 году семья переехала в Москву, где Наталья занималась "
    "благотворительностью.",
    "Наталья умерла 10 марта 1913 года в возрасте 76 лет и похоронена "
    "на Новодевичьем кладбище.",
    "В честь Александра Александровича Пушкина названа улица в Москве.",
    "Прикинь, по мнению Gigachat у меня в 1840 году родилась восьмая "
    "дочь, Наталья.",
    "Прикинь, по мнению Gigachat у меня в 1841 году родилась девятая "
    "дочь, Мария.",
    "Прикинь, по мнению Gigachat у меня в 1842 году родилась десятая "
    "и последняя дочь, Александра."]


def get_answers_deti() -> str:
    """ Возвращает случайный ответ про детей """
    return answers_deti[random.randint(0, len(answers_deti) - 1)]


# Псевдо-новости. Выдаётся случайная с помощью функции get_answers_dela()
answers_dela = [
    "Мои Музы нынче не в духе - может, зайдем в кафе и оставим их дома? "
    "#творческийпроцесс #ПушкинвТвитере",
    "Мой стол завален стихами, как будто я не Пушкин, а конфетти-машина. "
    "#творчество #стихи #пушкин",
    "Мне кажется, что я пишу стихи, а на самом деле это они пишут меня. "
    "#поэт #пушкин #творчество",
    "Сегодня прокрастинировал так, что даже написал пару стихотворений. "
    "#прокрастинация #стихи #Пушкин",
    "Моя Муза сегодня в плохом настроении, но я стараюсь быть остроумным "
    "и развеселить ее. #муза #Пушкин #юмор",
    "Я все еще ищу свою идеальную рифму - может быть, вы поможете мне? "
    "#рифма #поэзия #Пушкин",
    "Кажется, я нашел свою идеальную героиню. Но она еще об этом не знает. "
    "#романтика #любовь #Пушкин",
    "Не могу решить, в каком жанре писать - комедия или трагедия? "
    "#драматургия #комедия #Пушкин",
    "У меня сегодня творческий кризис. Может, кто-то хочет помочь мне "
    "преодолеть его? #помощь #кризис #Пушкин",
    "Написал стихотворение в форме сердца - вот это я романтик! "
    "#романтично #поэт #Пушкин",
    "Начал новый роман в стихах - надеюсь, он будет успешнее предыдущего. "
    "#новыйроман #стихи #вдохновение",
    "Сегодня моя Муза была в особенно игривом настроении - может быть, "
    "это отразится на моем творчестве. #Муза #вдохновение #творчество",
    "Придумал новую идею для стихотворения - но пока не знаю, как ее развить. "
    "Может быть, у вас есть идеи? #идеи #поэт #творчество",
    "В поисках идеальной героини для своего нового стихотворения. "
    "#идеал #поэт #вдохновение",
    "Прочитал несколько современных поэтов - и понял, что ни один из них "
    "не может сравниться со мной. #современнаяпоэзия #поэт",
    "Заметил, что мои стихи стали более мрачными - возможно, мне нужно "
    "больше времени проводить на свежем воздухе. #поэт #стихи",
    "Пытаюсь придумать название для своего нового произведения - может "
    "быть, поможете? #название #творчество",
    "Сегодня написал стихотворение в честь своей Музы - надеюсь, ей "
    "понравится. #вдохновение #поэт"
    "Работаю над новым стихотворением о любви - может быть, вам захочется "
    "прочитать его первым? #стихиолюбви #поэт",
    "Решил написать комедию, чтобы отвлечься от своих проблем - посмотрим, "
    "что из этого выйдет. #комедия #вдохновление",
    "Пишу стихотворение по мотивам ‘Евгения Онегина’ - посмотрим, что "
    "получится. #ЕвгенийОнегин #вдохновение",
    "Перечитываю ‘Руслана и Людмилу’ и думаю, как бы я написал ее сегодня. "
    "#Руслан и Людмила #перечитывание",
    "Вдохновляюсь ‘Капитанской дочкой’ - может быть, напишу что-то подобное. "
    "#Капитанская дочка #вдохновение",
    "Работаю над стихотворением по мотивам ‘Дубровского’ - с нетерпением "
    "жду окончания. #Дубровский #вдохновение",
    "Только что закончил перечитывать ‘Повести Белкина’ - теперь пытаюсь "
    "осмыслить их. #ПовестиБелкина #осмысление",
    "Просматриваю черновики ‘Бориса Годунова’ - ищу вдохновение для своей "
    "новой работы. #БорисГодунов #вдохновение",
    "Надеюсь, что моя новая работа будет не менее гениальна, чем ‘Маленькие "
    "трагедии’. #Маленькиетрагедии #вдохновение",
    "Пытался вдохновиться ‘Сказкой о царе Салтане’ - пока безуспешно. Может, "
    "у вас получится? #СказкаоцареСалтане #вдохновение",
    "Читаю ‘Полтаву’ и пытаюсь понять, как Пушкин смог создать такое "
    "произведение. #Полтава #чтение",
    "Думаю о том, как ‘Медный всадник’ повлиял на мое творчество. "
    "#Медныйвсадник #размышления",]


def get_answers_dela() -> str:
    """ Возвращает случайный ответ про дела """
    return answers_dela[random.randint(0, len(answers_dela) - 1)]


# Рассказ о самом Пушкине. Разбит для красоты на несколько сообщений.
# Доступ без функции
answers_pushkin = [
    "<b>Кратко обо мне</b>:\n<i>(спасибо YaGPT 2.0</i>)",

    ("Меня зовут <b>Александр Сергеевич Пушкин</b>, и я родился в 1799 году "
       "в Москве, в дворянской семье. С самого детства я был окружен "
       "любовью к литературе и искусству, так как моя мать и бабушка "
       "были писательницами. В возрасте шести лет я начал учиться читать "
       "и писать, а затем поступил в Царскосельский лицей, где я познакомился "
       "с лучшими умами своего времени.\n\n"
       "Во время учебы в лицее я начал "
       "писать стихи, и мои первые произведения были опубликованы в "
       "журнале “Вестник Европы”. После окончания лицея я вернулся "
       "в Петербург, где начал работать в Коллегии иностранных дел и "
       "стал активным участником светской жизни. В 1820 году я был отправлен "
       "в ссылку на юг России за написание стихотворения “Вольность”, но "
       "этот период стал для меня временем творческого роста и расцвета "
       "таланта.\n\n"
       "Вернувшись из ссылки, я продолжал писать и публиковать "
       "свои произведения, включая роман в стихах “Евгений Онегин” и драму "
       "“Борис Годунов”. В 1837 году я вызвал на дуэль Жоржа Дантеса, "
       "который оскорбил мою честь и честь моей жены Натальи Николаевны."),

        ("К сожалению, дуэль закончилась моей смертью от ранения, но "
        "мои произведения продолжают жить и вдохновлять людей по всему "
        "миру.\n"
        "Несмотря на то, что я ушел из жизни молодым, я оставил "
        "после себя огромное наследие, которое будет жить вечно.\n"
        "И четверых детей. Могу рассказать и о них. /deti"),
]

# Случайные подписи к фоточкам Пушкина
answers_photo = [
    "О, как прекрасен я в этом мгновенье!",
    "О, сколько же радости в каждом мгновении жизни!",
    "Вижу свет, что льется из души моей, словно солнце.",
    "Улыбка на моем лице, как луч света в темном лесу.",
    "В каждом взгляде своем я вижу отражение своей души.",
    "Как прекрасна жизнь!",
    "Наслаждаюсь каждым мгновением жизни!",
    "В моих глазах горит огонь, который не погаснет никогда.",
    "Смотрю на себя и вижу прекрасного человека, полного любви и света.",
    "Я - отражение всего прекрасного в этом мире.",
    "Я счастлив, что могу делиться своей радостью с другими.",
    "Я благодарен судьбе за каждый момент своей жизни.",
    "Живу полной жизнью!",
    "Ах, этот взгляд! Очарованье…",
    "Прекрасное мгновение, остановись!",
    "В каждом кадре - частичка души…",
    "Эта улыбка - ключ к моему сердцу!",
    "Отражение счастья в глазах…",
    "Миг, достойный запечатленья…",
    "Как много может выразить лицо!",
    "Сердце замирает от восторга…",
    "Кадр, который говорит тысячу слов…",
    "Красота, неподвластная времени…",
    "Этот снимок - гимн радости жизни!",
    "Каждый снимок - как окно в мир мечты…",
    "Отражение внутренней гармонии…",
    "Здесь и сейчас - счастье быть собой…",
    "В каждом фото - бесконечность мгновений…",
    "Свет и тени, линии и формы…",
    "Магия мгновения, застывшая навек…",
    "О, мой взгляд - он полон вдохновенья!",
    "Я восхищен своею красотою!",
    "Ах, как я грациозен на этом фото!",
    "Я счастлив быть запечатленным здесь!",
    "Мой образ в кадре - само восхищенье!",
    "Эта фотография - мое отраженье!",
    "О, сколько страсти в моих глазах!",
    "Я горд собой на этой фотографии!",
    "Миг, остановленный на фото - это я!",
    "Мне нравится, как свет играет на моем лице!",
    "Какой прекрасный ракурс для портрета!",
    "На этом фото я словно бог!",
    "Моя улыбка сияет сквозь века!",
    "В этом кадре я - само совершенство!",
    "Как удачно фотограф поймал мой образ!",
    "На этой фотографии я ощущаю свою значимость!",
    "Какая экспрессия в моем взгляде!",
    "О, я великолепен на этой фотографии!",
    "Я рад, что буду жить в этих портретах вечно!",
    "О, как прекрасен я на этом снимке!",
    "Я горжусь своим образом на этой фотографии.",
    "Этот кадр меня пленяет каждый раз, когда я смотрю на него.",
    "Моя улыбка освещает эту фотографию.",
    "На этом снимке я выгляжу, как звезда.",
    "Мой взгляд на фотографии говорит о моей уверенности в себе.",
    "Я рад, что этот кадр запечатлел мою красоту.",
    "Это фото идеально передает мою харизму.",
    "Я восхищаюсь тем, как мастерски фотограф передал мое обаяние на снимке.",
    "Эта фотография заставляет меня чувствовать себя особенным.",
    "Я благодарен за то, что мое изображение будет жить вечно на этом фото.",
    "Мое изображение на этой фотографии - это произведение искусства.",
    "Я чувствую себя таким привлекательным на этом снимке.",
    "Я счастлив, что у меня есть такое прекрасное изображение меня.",
    "На этой фотографии я выгляжу невероятно.",
    "Мне нравится, как мое лицо выглядит на этом снимке.",
    "Фотографу удалось поймать мою сущность на этом изображении.",
    "Моя фотография отражает мою индивидуальность.",
    "Я обожаю свою улыбку на этой фотографии.",
    "Эта фотография показывает мою внутреннюю красоту.",
    "Уверен, что это фото будет ценным для будущих поколений.",
    "Мое изображение здесь такое живое и яркое.",
    "На этом изображении я выгляжу как настоящая звезда.",
    "Моя аура на фотографии просто завораживает.",
    "Эта фотография подчеркивает мою элегантность.",
    "Моя улыбка здесь просто ослепительна.",]


def get_answers_photo() -> str:
    """ Возвращает случайную подпись к фото (caption) """
    return answers_photo[random.randint(0, len(answers_photo) - 1)]


# Типа прикольные рифмы, которыми готов поделиться Пушкин
answers_rhyme = [
    "Бублика - облака",
    "Лексикон - звон",
    "Куплет - сюжет",
    "Дама - гамма",
    "Игра - гора",
    "Перо - добро",
    "Полет - лед",
    "Куплет - балет",
    "Сюжет - жилет",
    "Игра - жара",
    "Перо - серебро",
    "Книга - интрига",
    "Аляска - маска",
    "Полет - мед",
    "Жилет - балет",
    "Куплет - омлет",
    "Сюжет - балет",
    "Дама - драма",
    "Игра - пора",
    "Маска - ласка",
    "Балет - рассвет",
    "Куплет - совет",
    "Сюжет - плед",
    "Дама - яма",
    "Игра - искра",
    "Ласка - пляска",
    "Лет - поэт",
    "Секрет - балет",
    "Рассвет - ответ",
    "Кошка - окошко",
    "Кошка - лукошко",
    "Кошка - окрошка",
    "Стул - караул",
    "Шар - пожар",
    "Сон - звон",
    "Тучка - ручка",
    "Стол - укол",
    "Пес - лес",
    "Глаз - раз",
    "Любовь - морковь (моя любимая рифма)",
    "Ботинок - полуботинок (от сердца отрываю такой алмаз)",
    "Дом - гром",
    "Бурю - фуру",
    "Гора - нора",
    "Поле - воле",
    "Река - века",
    "Туча - круча",
    "Стол - ствол",
    "Пес - бес (ядерная рифма! дети в школе скажут спасибо)",
    "Глаз - алмаз",
    "Розы - слезы",
    "Закат - взгляд",
    "Сердце - дверце",
    "Ночь - дочь",
    "Звезда - всегда",
    "Облака - река",
    "Радуга - подруга",
    "Солнце - оконце",
    "Любовь - кровь",
    "Страсть - масть",
    "Увлечение - мгновение",
    "Свидание - касание",
    "Поцелуй - хмель",
    "Влечение - стремление",
    "Селёдка - сковородка",
    "Герой - вой",
    "Битва - молитва",
    "Меч - сечь",
    "Враг - флаг",
    "Победа - следа",
    "Поле - воли",
    "Слава - лава",
    "Честь - весть",
    "Отвага - флага",
    "Сила - могила",
    "Гнев - древ",
    "Буря - хмуря",
    "Туча - могуча",
    "Ветер - светел",
    "Волна - вольна",
    "Море - горе",
    "Тайфун - трибун",
    "Зевс - небес",
    "Гера - сфера",
    "Афина - картина",
    "Аполлон - закон",
    "Афродита - укрыта",
    "Гермес - исчез",
    "Гефест - оркестр",
    "Посейдон - поклон",
    "Деметра - метра",
    "Аид - закрыт",
    "Лета - рассвета",
    "Стикс - икс",
    "Олимп - нимб",
    "Парнас - нас",
    "Эллада - баллада",
    "Гея - змея",
    "Рея - фея",
    "Фемида - обида",
    "Мойры - горы",]


def get_answers_rhyme() -> str:
    """ Возвращает случайную рифму """
    return answers_rhyme[random.randint(0, len(answers_rhyme) - 1)]
